# CurveElemLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveElemLength Property
ParameterTypeId Class See Also
---
"Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveElemLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveElemLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveElemLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace